In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\valse\appdata\local\programs\python\python310\lib\site-packages (1.4.2)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\valse\appdata\roaming\python\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\valse\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\valse\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.22.3)
Requirement already satisfied: six>=1.5 in c:\users\valse\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
## Import Pandas
import pandas as pd

In [2]:
#task 1 Rows and columns
import pandas as pd
tourist=pd.read_csv("Holiday.csv")
print(tourist)
tourist.shape

    Destination  Score  Average  Hotel Visited city Unnamed: 5
0         India      6        5    120        Delhi
1         China      7        4    130      Beijing        NaN
2         Spain      6        5    140       Madrid        NaN
3         Italy      9        6    200         Rome        NaN
4        Greece      8        5    100        Corfu        NaN
5        France      9        1    120        paris        NaN
6           USA      6        5    130      newyork        NaN
7           UAE      7        4    120        Dubai        NaN
8      Portugal      6        3    150       Lisban        NaN
9      Maldices      8        6    120        Maldi        NaN
10     Thailand      9        4    120       bangok        NaN
11       Africa      7        4    150       Durham        NaN
12       Poland      6        5    100         Pola        NaN
13  Switzerland      6        6    110       Geneva        NaN
14    Singapore      7        4    100         City        NaN

(15, 6)

In [3]:
# task 2print row {3,8 using loc,iloc}
touristdata2=pd.read_csv("holiday.csv",index_col="Destination")
#print(touristdata2.loc[["India","UAE"]])
#print(touristdata.iloc[[4,8]])
data = pd.read_csv("holiday.csv")
print(data.iloc[7,4])
print(data.iloc[3:7,2:4])

Dubai
   Average  Hotel
3        6    200
4        5    100
5        1    120
6        5    130

In [8]:
#task 3mean number of all inclusive hotel of all destinatiom
import pandas as pd
data=pd.read_csv("holiday.csv")
data["Hotel"].mean()
data["Average"].mean()

4.466666666666667

In [14]:
#task 4 Find the lowest scoring destination
holiday_file=pd.read_csv("holiday.csv")
max_filter= holiday_file["Score"]== holiday_file["Score"].min()
holiday_file[max_filter]

    Destination  Score  Average  Hotel Visited city Unnamed: 5
0         India      6        5    120        Delhi
2         Spain      6        5    140       Madrid        NaN
6           USA      6        5    130      newyork        NaN
8      Portugal      6        3    150       Lisban        NaN
12       Poland      6        5    100         Pola        NaN
13  Switzerland      6        6    110       Geneva        NaN

In [13]:
#task 5 Find the highest scoring destination
holiday_file=pd.read_csv("holiday.csv")
max_filter= holiday_file["Score"]== holiday_file["Score"].max()
holiday_file[max_filter]

   Destination  Score  Average  Hotel Visited city Unnamed: 5
3        Italy      9        6    200         Rome        NaN
5       France      9        1    120        paris        NaN
10    Thailand      9        4    120       bangok        NaN

In [16]:
# destination morevthan 9 All inclusive hotel
import pandas as pd
data = pd.read_csv("Holiday.csv")
tourist_filter=(data["Hotel"]== 200)
#tourist_filter = (data["Score"] > 3) & (data["Hotel"] == 120)
filter = data[tourist_filter] 
filter.head(3)

  Destination  Score  Average  Hotel Visited city Unnamed: 5
3       Italy      9        6    200         Rome        NaN

In [23]:
#Tassk 7 Filter te data by score above 8
tourist_filter = (data["Score"] > 8)
filter=data[tourist_filter] 
filter.head(3)

   Destination  Score  Average  Hotel Visited city Unnamed: 5
3        Italy      9        6    200         Rome        NaN
5       France      9        1    120        paris        NaN
10    Thailand      9        4    120       bangok        NaN

   Owner_Surname  Pet_Name  Pet_Age  Last_Visit      Type Chipped Unnamed: 6
0          Adams    Fluffy        2  11/05/2020       Cat     Yes
1          Smith      Zuko        8  30/01/2019       Dog     Yes        NaN
2      Radcliffe      Nala        4  24/11/2019       Dog     Yes        NaN
3        Holland  Mr Chips       10  15/06/2019       Dog      No        NaN
4         Potter     Daisy        9  07/04/2020    Rabbit     Yes        NaN
5         Sorola     Oscar        1  27/02/2020   Hamster      No        NaN
6           Pike     Pepsi        6  18/09/2019       Cat     Yes        NaN
7         Murray    George       17  12/02/2020  Tortoise      No        NaN
8          Aston     Monty        3  09/03/2020       Dog     Yes        NaN
9         Waller       Flo        7  06/05/2019       Cat     Yes        NaN
10   De la Force     Anton        2  31/08/2019       Cat      No        NaN
11          Reed     Farah        5  02/03/2020     Horse      No        NaN
12      Martinez     Homer        6  24/11/2019       Dog     Yes        NaN
13            Li      Iggy        5  14/12/2019       Dog     Yes        NaN
14     Rodriquez     Bobby        3  28/02/2020    Rabbit      No        NaN

In [15]:
print(vetdata[["Type", "Pet_Age", "Chipped"]])
#print(touristdata[["Feeedback score", "Average"]])

        Type  Pet_Age Chipped
0        Cat        2     Yes
1        Dog        8     Yes
2        Dog        4     Yes
3        Dog       10      No
4     Rabbit        9     Yes
5    Hamster        1      No
6        Cat        6     Yes
7   Tortoise       17      No
8        Dog        3     Yes
9        Cat        7     Yes
10       Cat        2      No
11     Horse        5      No
12       Dog        6     Yes
13       Dog        5     Yes
14    Rabbit        3      No

In [35]:
#print row {3,8 using loc,iloc}
touristdata2=pd.read_csv("holiday.csv",index_col="Destination")
#print(touristdata2.loc[["India","UAE"]])
#print(touristdata.iloc[[4,8]])
data = pd.read_csv("holiday.csv")
print(data.iloc[7,4])
print(data.iloc[3:7,2:4])

Dubai
   Average  Hotel
3        6    200
4        5    100
5        1    120
6        5    130

In [41]:
#mean number of all inclusive hotel of all destinatiom
import pandas as pd
data=pd.read_csv("holiday.csv")
data["Hotel"].mean()
#data["Average"].mean()

127.33333333333333

In [3]:
import pandas as pd
data = pd.read_csv("holiday.csv")
myfilter = data["Score"] > 5
highscore = data[myfilter]
highscore.head()

  Destination  Score  Average  Hotel Visited city Unnamed: 5
0       India      6        5    120        Delhi
1       China      7        4    130      Beijing        NaN
2       Spain      6        5    140       Madrid        NaN
3       Italy      9        6    200         Rome        NaN
4      Greece      8        5    100        Corfu        NaN

In [52]:
# print the no of rows and colums
import pandas as pd
data=pd.read_csv("holiday.csv")
data.shape
data.tail(3)

    Destination  Score  Average  Hotel Visited city Unnamed: 5
12       Poland      6        5    100         Pola        NaN
13  Switzerland      6        6    110       Geneva        NaN
14    Singapore      7        4    100         City        NaN

In [59]:
import pandas as pd
data = pd.read_csv("Holiday.csv")
highscore = data[myfilter]
highscore.tail()

   Destination  Score  Average  Hotel Visited city Unnamed: 5
3        Italy      9        6    200         Rome        NaN
5       France      9        1    120        paris        NaN
10    Thailand      9        4    120       bangok        NaN

In [55]:
import pandas as pd
data = pd.read_csv("Holiday.csv")
highscore = data[myfilter]
highscore.head()

   Destination  Score  Average  Hotel Visited city Unnamed: 5
3        Italy      9        6    200         Rome        NaN
5       France      9        1    120        paris        NaN
10    Thailand      9        4    120       bangok        NaN

In [2]:
#Is there a correlation between number of all-inclusive hotels and score
import pandas as pd
tourist=pd.read_csv("Holiday.csv")
print(tourist)
tourist.shape
print(touristdata[["Score","Hotel"]])
tourist.corr()
df.plot

    Destination  Score  Average  Hotel Visited city Unnamed: 5
0         India      6        5    120        Delhi
1         China      7        4    130      Beijing        NaN
2         Spain      6        5    140       Madrid        NaN
3         Italy      9        6    200         Rome        NaN
4        Greece      8        5    100        Corfu        NaN
5        France      9        1    120        paris        NaN
6           USA      6        5    130      newyork        NaN
7           UAE      7        4    120        Dubai        NaN
8      Portugal      6        3    150       Lisban        NaN
9      Maldices      8        6    120        Maldi        NaN
10     Thailand      9        4    120       bangok        NaN
11       Africa      7        4    150       Durham        NaN
12       Poland      6        5    100         Pola        NaN
13  Switzerland      6        6    110       Geneva        NaN
14    Singapore      7        4    100         City        NaN

NameError: name 'touristdata' is not defined

In [20]:
tourist_file.plot.bar(y='Score')

NameError: name 'tourist_file' is not defined